"""распаковка"""

a, b, c = input("Три символа: ")  # при вводе больше 3-х - ошибка
print(f'{a = }\t{b = }\t{c = }')

a, b, c = {"один", "два", "три", "четыре"}  # подсвечивается, потому что больше 3-х - ошибка
print(f'{a = }\t{b = }\t{c = }')

data = ["один", "два", "три", "четыре", "пять", "шесть", "семь", ]
a, b, c, *d = data
print(f'{a=} {b=} {c=} {d=}')
a, b, *c, d = data
print(f'{a=} {b=} {c=} {d=}')
a, *b, c, d = data
print(f'{a=} {b=} {c=} {d=}')
*a, b, c, d = data
print(f'{a=} {b=} {c=} {d=}')
